# Specify a directory to install
cask_args appdir: '/Applications'

# Add additional repositories
tap 'homebrew/bundle'

# Install packages
brew 'wget'
brew 'pipenv'

# Casks
## Development tools
#cask 'iterm2'
cask 'hyper'
cask 'sourcetree'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'typora'
#cask 'atom'

## Networking
cask 'wireshark'
cask 'postman'

## Utilities
cask 'istat-menus'
cask 'enpass'
cask 'google-chrome'
cask 'teamviewer'
cask 'vmware-fusion'
cask 'the-unarchiver'
cask 'mipony'
#cask 'agenda'
#cask 'omnigraffle'
#cask 'wunderlist'

## Social
cask 'skype'
cask 'discord'
#cask 'telegram'
#cask 'slack'

## Media & Entertainments
cask 'iina'
cask 'spotify'
cask 'qbittorrent'
cask 'plex-media-server'
cask 'steam'
