# Specify a directory to install
cask_args appdir: '/Applications'

# Add additional repositories
tap 'homebrew/bundle'

# Install packages
brew 'wget'
brew 'autojump'
brew 'kubernetes-cli'
brew 'helm'
brew 'mtr'
brew 'k9s'
brew 'tree'
brew 'uv'
brew 'oven-sh/bun/bun'
brew 'kubectx'
brew 'gonzo'		# TUI for log analysis

# Casks
## Development tools
cask 'ghostty'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'lens'
cask 'orbstack'
cask 'rectangle'

## Note
cask 'notion'

## Networking
#cask 'wireshark'
#cask 'postman'

## Utilities
#cask 'istat-menus'
cask 'google-chrome'
#cask 'teamviewer'
cask 'the-unarchiver'
#cask 'authy'

## Social
cask 'skype'
cask 'discord'
cask 'telegram-desktop'

## Media & Entertainments
cask 'iina'
cask 'spotify'
